app/Http/Controllers/Auth/LoginController.php

    protected function authenticated(Request $request, $user){
        $user->last_login = date('Y-m-d H:i:s');
        $user->save();
---
update `users` set `updated_at` = '2021-05-12 11:24:16', `last_login` = '2021-05-12 11:24:16' where `id` = 325