app/Http/Controllers/PermissoesController.php

select `permissions`.*, `funcionalidade_permission`.`funcionalidade_id` as `pivot_funcionalidade_id`, `funcionalidade_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `funcionalidade_permission` on `permissions`.`id` = `funcionalidade_permission`.`permission_id` where `funcionalidade_permission`.`funcionalidade_id` in (50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60)
---
    public function index(){
        $permissao = new Permission;
        $modulo = new Modulo;
        $funcionalidades = new Funcionalidade;

        $view = view('permissoes.index')
            ->with('moduloWithFuncionalidades', $modulo->getModulosWithFuncionalidades())
            ->with('moduloNoRelations', count($modulo->modulosNoRelations()))
            ->with('permissionsVinculadas', $funcionalidades->permissoesVinculadas())
            ->with('permissionsSemVinculo', count($permissao->permissionsNoRelations()))
            ->with('dataFuncionalidades', $funcionalidades->getFuncionalidades()->get())
            ->with('totalModulos', $modulo->count())
            ->with('modulosAtivos', count($modulo->getModulosAtivos()))
            ->with('modulosInativos', count($modulo->getModulosInativos()))
            ->with('permAdicionar', count($permissao->permissionsAdded()))
            ->with('permRemover', count($permissao->permissionsRemoved()))
            ->with('total', $permissao->count())
            ->with('lastLogin', Auth::user()->last_login);