app/Models/FuncionalidadesRole.php

    public function getPermissionsByRoles(Array $roles){
        return $this
            ->join('funcionalidades as f', 'f.id', '=', 'funcionalidade_role.funcionalidade_id')
            ->join('roles as r', 'r.id', '=', 'funcionalidade_role.role_id')
            ->join('funcionalidade_permission as fp', 'fp.funcionalidade_id', '=', 'f.id')
            ->join('permissions as p', 'p.id', '=', 'fp.permission_id')
            ->whereIn('r.id', $roles)
            ->pluck('p.name')->toArray();
---
select `p`.`name` from `funcionalidade_role` inner join `funcionalidades` as `f` on `f`.`id` = `funcionalidade_role`.`funcionalidade_id` inner join `roles` as `r` on `r`.`id` = `funcionalidade_role`.`role_id` inner join `funcionalidade_permission` as `fp` on `fp`.`funcionalidade_id` = `f`.`id` inner join `permissions` as `p` on `p`.`id` = `fp`.`permission_id` where `r`.`id` in (1, 25)