app/Models/Funcionalidade.php

    public function saveFuncionalidade($request = []){
        try{
            DB::beginTransaction();
            $dbFuncionalidades = $this->fill([
                'nome' => $request['nome'],
                'modulo_id' => $request['modulo_id'],
                'active' => $request['active']
            ]);

            $dbFuncionalidades->save();
---
insert into `funcionalidades` (`nome`, `modulo_id`, `active`, `updated_at`, `created_at`) values ('Países', '4', '1', '2021-05-12 11:46:40', '2021-05-12 11:46:40')