app/Models/Modulo.php

select * from `modulos` where not exists (select * from `funcionalidades` where `modulos`.`id` = `funcionalidades`.`modulo_id`)
---
    public function modulosNoRelations(){
        return $this->doesntHave('funcionalidades')->get();

select * from `modulos` where `active` = 1
---
    public function getModulosAtivos(){
        return $this->where('active','=',1)->get();

select * from `modulos` where `active` = 0
---
    public function getModulosInativos(){
        return $this->where('active', '=', 0)->get();

select * from `funcionalidades` where `funcionalidades`.`modulo_id` in (1, 2, 4, 5)
select * from `modulos`
select `permissions`.*, `funcionalidade_permission`.`funcionalidade_id` as `pivot_funcionalidade_id`, `funcionalidade_permission`.`permission_id` as `pivot_permission_id` from `permissions` inner join `funcionalidade_permission` on `permissions`.`id` = `funcionalidade_permission`.`permission_id` where `funcionalidade_permission`.`funcionalidade_id` in (50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60)
select `roles`.*, `funcionalidade_role`.`funcionalidade_id` as `pivot_funcionalidade_id`, `funcionalidade_role`.`role_id` as `pivot_role_id` from `roles` inner join `funcionalidade_role` on `roles`.`id` = `funcionalidade_role`.`role_id` where `funcionalidade_role`.`funcionalidade_id` in (50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60)
---
    public function getModulosWithFuncionalidades(){
        return $this
            ->with(['funcionalidades.funcionalidadesPermissions', 'funcionalidades.funcionalidadesRole'])
            ->get();