app/Models/Pais.php

insert into `pais` (`pais_sigla`, `ativo`, `pais`) values ('PT', 'S', 'Portugal')
---
    public function savePais($request = []){
        try{
            $this->fill($request)->save();

update `pais` set `ativo` = 'N' where `id` = 2
---
    public function updatePais($id, $request = []){
        try{
            $pais = $this->find($id);
            $pais->fill($request)->save();

delete from `pais` where `id` = 4
---
    public function deletePais($id){
        if($this->find($id)->delete()){