app/Models/Permission.php

    public function permissionsRemoved(){
        $routes = \Route::getRoutes();
        $routeNames = $this->prepareNameRoutes($routes);
        $dbPermissions = $this->pluck('name')->toArray();
---
select `name`, `id` from `permissions` where
id IN (
SELECT permission_id FROM funcionalidade_permission
);

   public function permissionsNoRelations(){
        return $this->doesntHave('funcionalidades')->get();
---
select CONCAT(name, "*") as nameOrfa, `id` from `permissions` where id NOT IN (
SELECT permission_id FROM funcionalidade_permission
);