app/Models/Role.php

select * from `roles`
---
    public function getRoles(){
       return $this->all();