app/Models/Setor.php

    public function getSetores(){
        return $this->all();
---
select * from `setor`