app/Models/User.php

    public function getUserById($id){
        $data = $this
                ->with('rolesByUser', 'userSetor')
                ->find($id);
---
select * from `setor` where `setor`.`id` in (4)
select * from `users` where `users`.`id` = 325 limit 1

    public function changeProfilePicture($file){
        try{
            $user = Auth::user();
            $path = Storage::disk('local')->put('/public/users/'.$user->id, $file);

            $user->url_photo = Storage::url($path);
            $user->save();
---
update `users` set `updated_at` = '2021-05-11 15:10:05', `url_photo` = '/storage/users/325/UfUq7jgi7baOpy4yav5LDS0GcIhNjUgmSd3FXurA.jpg' where `id` = 325