app/Models/ZonaTuristica.php

select * from `zona_turistica` where 0 = 1
---
    public function getZT($request = []){
        $conditions = [];

        if(isset($request['zona_turistica']) && !empty($request['zona_turistica'])){
            $conditions[] = ['zona_turistica', 'LIKE', "%".$request['zona_turistica']."%"];
        }

        if(isset($request['ativo']) && !empty($request['ativo'])){
            $conditions[] = ['ativo', '=', $request['ativo']];
        }

        return $this
            ->where($conditions)
            ->with('zonaTuristicaPai')
            ->paginate(7);